{
    "common": {
        "name": "utility-monitor",
        "version": "1.6.1",
        "news": {
            "1.6.1": {
                "en": "New statistics data points: lastDay, lastWeek, lastMonth, and lastYear for costs and consumption.",
                "de": "Neue Statistik-Datenpunkte: lastDay, lastWeek, lastMonth, lastYear für Kosten und Verbrauch.",
                "ru": "Новые точки статистических данных: lastDay, lastWeek, lastMonth и lastYear для затрат и потребления.",
                "pt": "Novos pontos de dados estatísticos: lastDay, lastWeek, lastMonth e lastYear para custos e consumo.",
                "nl": "Nieuwe statistiekgegevenspunten: lastDay, lastWeek, lastMonth en lastYear voor kosten en verbruik.",
                "fr": "Nouveaux points de données statistiques : lastDay, lastWeek, lastMonth et lastYear pour les coûts et la consommation.",
                "it": "Nuovi punti dati statistici: lastDay, lastWeek, lastMonth e lastYear per costi e consumi.",
                "es": "Nuevos puntos de datos estadísticos: lastDay, lastWeek, lastMonth y lastYear para costes y consumo.",
                "pl": "Nowe punkty danych statystycznych: lastDay, lastWeek, lastMonth i lastYear dla kosztów i zużycia.",
                "uk": "Нові статистичні дані: lastDay, lastWeek, lastMonth і lastYear для витрат і споживання.",
                "zh-cn": "新的统计数据点：成本和消耗的 lastDay、lastWeek、lastMonth 和 lastYear。"
            },
            "1.6.0": {
                "en": "New: Structured statistics with consumption and cost sub-channels. New: Weekly and monthly cost tracking. Refactoring: Split stateManager.js into modular files. Cleanup: Removed redundant old statistics states.",
                "de": "Neu: Strukturierte Statistiken mit Unterkanälen für Verbrauch und Kosten. Neu: Wöchentliche und monatliche Kostenverfolgung. Refactoring: stateManager.js in modulare Dateien aufgeteilt. Bereinigung: Veraltete Statistik-Datenpunkte entfernt."
            },
            "1.5.1": {
                "en": "Fix: Reset timing and monthly calculation logic. Fix: JSDoc type definitions.",
                "de": "Fix: Reset-Timing und monatliche Berechnungslogik. Fix: JSDoc Typ-Definitionen.",
                "ru": "Исправление: время сброса и логика ежемесячного расчета. Исправление: определения типов JSDoc.",
                "pt": "Correção: tempo de redefinição e lógica de cálculo mensal. Correção: definições de tipo JSDoc.",
                "nl": "Fix: Reset timing en maandelijkse berekeningslogica. Fix: JSDoc type definities.",
                "fr": "Correctif : synchronisation de la réinitialisation et logique de calcul mensuel. Correctif : définitions de type JSDoc.",
                "it": "Correzione: tempi di ripristino e logica di calcolo mensile. Correzione: definizioni dei tipi JSDoc.",
                "es": "Solución: sincronización de reinicio y lógica de cálculo mensual. Solución: definiciones de tipos de JSDoc.",
                "pl": "Naprawa: czas resetowania i logika obliczeń miesięcznych. Naprawa: definicje typów JSDoc.",
                "uk": "Виправлення: час скидання та логіка щомісячного розрахунку. Виправлення: визначення типів JSDoc.",
                "zh-cn": "修复：重置时间和每月计算逻辑。修复：JSDoc 类型定义。"
            },
            "1.5.0": {
                "en": "New: CSV Import feature with drag and drop support. New: Weekly tracking points. Fix: Resets now performed at 23:59. Refactoring: Modular backend architecture.",
                "de": "Neu: CSV-Import mit Drag-and-Drop. Neu: Wöchentliche Datenpunkte. Fix: Resets werden jetzt um 23:59 Uhr ausgeführt. Refactoring: Modulare Backend-Architektur.",
                "ru": "Новое: функция импорта CSV с поддержкой перетаскивания. Новое: точки еженедельного отслеживания. Исправление: сброс теперь выполняется в 23:59. Рефакторинг: модульная архитектура бэкенда.",
                "pt": "Novo: recurso de importação de CSV com suporte para arrastar e soltar. Novo: pontos de rastreamento semanais. Correção: as reinicializações agora são realizadas às 23:59. Refatoração: arquitetura de back-end modular.",
                "nl": "Nieuw: CSV-importfunctie met drag-and-drop-ondersteuning. Nieuw: Wekelijkse trackingpunten. Fix: Resets worden nu uitgevoerd om 23:59 uur. Refactoring: Modulaire backend-architectuur.",
                "fr": "Nouveau : fonctionnalité d'importation CSV avec prise en charge du glisser-déposer. Nouveau : points de suivi hebdomadaires. Correction : les réinitialisations sont désormais effectuées à 23:59. Refactorisation : architecture backend modulaire.",
                "it": "Nuovo: funzione di importazione CSV con supporto drag-and-drop. Nuovo: punti di tracciamento settimanali. Correzione: i ripristini vengono ora eseguiti alle 23:59. Refactoring: architettura backend modulare.",
                "es": "Nuevo: función de importación de CSV con soporte para arrastrar y soltar. Nuevo: puntos de seguimiento semanali. Corrección: los reinicios ahora se realizan a las 23:59. Re-factorización: arquitectura de backend modular.",
                "pl": "Nowość: funkcja importu CSV z obsługą przeciągnij i upuść. Nowość: tygodniowe punkty śledzenia. Naprawa: resety wykonywane teraz o 23:59. Refaktoryzacja: modułowa architektura backendu.",
                "uk": "Нове: функція імпорту CSV з підтримкою перетягування. Нове: щотижневі точки відстеження. Виправлення: скидання тепер виконується о 23:59. Рефакторинг: модульна архітектура бекенда.",
                "zh-cn": "新增：支持拖放的 CSV 导入功能。新增：每周跟踪点。修复：现在在 23:59 执行重置。重构：模块化后端架构。"
            }
        },
        "titleLang": {
            "en": "Utility Costs Monitor",
            "de": "Nebenkosten-Monitor",
            "ru": "Монитор коммунальных расходов",
            "pt": "Monitor de Custos de Utilidades",
            "nl": "Nutskosten Monitor",
            "fr": "Moniteur des Coûts des Services Publics",
            "it": "Monitor dei Costi delle Utenze",
            "es": "Monitor de Costos de Servicios",
            "pl": "Monitor Kosztów Mediów",
            "uk": "Монітор комунальних витрат",
            "zh-cn": "公用事业费用监控器"
        },
        "desc": {
            "en": "Monitor gas, water, and electricity consumption with cost calculation",
            "de": "Überwachung von Gas, Wasser und Strom mit Kostenrechnung",
            "ru": "Мониторинг потребления газа, воды и электроэнергии с расчетом затрат",
            "pt": "Monitorar consumo de gás, água e eletricidade com cálculo de custos",
            "nl": "Monitor gas-, water- en elektriciteitsverbruik met kostenberekning",
            "fr": "Surveiller la consommation de gaz, d'eau et d'électricité avec calcul des coûts",
            "it": "Monitorare il consumo di gas, acqua ed elettricità con calcolo dei costi",
            "es": "Monitorear el consumo de gas, agua y electricidad con cálculo de costos",
            "pl": "Monitoruj zużycie gazu, wody i energii elektrycznej z obliczaniem kosztów",
            "uk": "Моніторинг споживання газу, води та електроенергії з розрахунком витрат",
            "zh-cn": "监控燃气、水和电力消耗并计算成本"
        },
        "authors": ["fischi87 <axel.fischer@hotmail.com>"],
        "keywords": ["utility", "electricity", "gas", "water", "metering"],
        "licenseInformation": {
            "license": "MIT",
            "type": "free"
        },
        "platform": "Javascript/Node.js",
        "icon": "utility-monitor.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/fischi87/ioBroker.utility-monitor/main/admin/utility-monitor.png",
        "readme": "https://github.com/fischi87/ioBroker.utility-monitor",
        "loglevel": "info",
        "tier": 3,
        "mode": "daemon",
        "type": "metering",
        "compact": true,
        "messagebox": true,
        "connectionType": "local",
        "dataSource": "push",
        "adminUI": {
            "config": "json"
        },
        "dependencies": [
            {
                "js-controller": ">=6.0.11"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=7.6.17"
            }
        ]
    },
    "native": {
        "gasAktiv": false,
        "gasMainMeterName": "main",
        "gasSensorDP": "",
        "gasOffset": 0,
        "gasInitialReading": 0,
        "gasBrennwert": 11.5,
        "gasZahl": 0.95,
        "gasPreis": 0,
        "gasGrundgebuehr": 0,
        "gasAbschlag": 0,
        "wasserAktiv": false,
        "wasserMainMeterName": "main",
        "wasserSensorDP": "",
        "wasserOffset": 0,
        "wasserInitialReading": 0,
        "wasserPreis": 0,
        "wasserGrundgebuehr": 0,
        "wasserAbschlag": 0,
        "stromAktiv": false,
        "stromMainMeterName": "main",
        "stromSensorDP": "",
        "stromOffset": 0,
        "stromInitialReading": 0,
        "stromPreis": 0,
        "stromGrundgebuehr": 0,
        "stromAbschlag": 0,
        "pvAktiv": false,
        "pvMainMeterName": "main",
        "pvSensorDP": "",
        "pvOffset": 0,
        "pvInitialReading": 0,
        "pvContractStart": "",
        "pvPreis": 0,
        "pvGrundgebuehr": 0,
        "pvJahresgebuehr": 0,
        "notificationEnabled": false,
        "notificationInstance": "",
        "notificationDaysBefore": 30,
        "notificationGasEnabled": false,
        "notificationGasMeters": [],
        "notificationWasserEnabled": false,
        "notificationWasserMeters": [],
        "notificationStromEnabled": false,
        "notificationStromMeters": [],
        "notificationPVEnabled": false,
        "notificationPVMeters": [],
        "notificationBillingEnabled": true,
        "notificationBillingDays": 7,
        "notificationChangeDays": 60,
        "sensorSpikeThreshold": 500
    },
    "objects": [],
    "instanceObjects": []
}
